[
  {
  "id": 1,
  "title": "‘Lokah: Chapter 1 – Chandra’ crosses ₹211 CR worldwide in 14 days — Malayalam cinema’s first female superhero shatters records",
  "excerpt": "Kalyani Priyadarshan’s superhero film sets new global benchmarks for Malayalam cinema.",
  "content": "‘Lokah: Chapter 1 – Chandra’, the first female-led superhero film in Malayalam cinema, has stormed the box office, collecting an impressive ₹211.61 crore worldwide in just 14 days since its release on August 28. The film grossed ₹97.85 crore net in India and ₹96.15 crore overseas, surpassing Mohanlal’s ‘Thudarum’ to become the second highest-grossing Malayalam film internationally.\n\nMade on a modest budget of ₹30 crore, the movie has already delivered profits of nearly ₹68 crore from India alone, with a staggering 226% return on investment. Trade experts call it a game-changer, redefining how Malayalam cinema travels across India and abroad.\n\nThe film’s dubbed versions in Hindi, Tamil, and Telugu are pulling huge crowds, contributing to its pan-India success. On BookMyShow, it has sold close to 4 million tickets, becoming the third-fastest Malayalam film to cross major ticketing milestones.\n\nPowered by Kalyani Priyadarshan’s performance, ‘Lokah’ has maintained strong occupancy rates, averaging 95% in its opening week, especially around Onam. Word-of-mouth and repeat viewings continue to drive demand, with fans already buzzing about future installments teased in the end credits, featuring Tovino Thomas and Dulquer Salmaan.\n\nIndustry analysts see the film’s success as part of a larger upward trend in Malayalam cinema, with bold storytelling and diverse genres attracting audiences across India and international markets.",
  "author": "Cinema Desk",
  "date": "2025-09-12",
  "category": "Box Office",
  "image": "/lk1.png"
},
  {
    "id": 2,
    "title": "Mammootty: The Transformative Titan of Malayalam Cinema",
    "excerpt": "Malayalam cinema’s greatest chameleon, who reinvents himself with every role.",
    "content": "For more than four decades, Mammootty has stood as one of Malayalam cinema’s most enduring and influential figures. Alongside Mohanlal, he represents the twin pillars of Kerala’s film industry, but unlike many superstars across Indian cinema, Mammootty has built his career not on stardom, but on the power of transformation.\n\nHe is often described as a master of reinvention—a performer who can inhabit characters across age, class, and temperament without ever allowing his own larger-than-life image to overshadow them. His craft lies in the subtlety of observation, the ability to slip into the everyday struggles and triumphs of his roles. This quality has made him not just a star, but an artist respected across generations.\n\nTake *Peranbu* for instance, where Mammootty portrays Amudhavan, a father left to care for his differently-abled daughter after his wife abandons him. It is one of the actor’s most powerful roles, balancing frustration, compassion, and vulnerability. The character’s quiet acts—feeding his daughter with care, cleaning her surroundings, or learning to understand her world—are played with a tenderness that goes beyond performance. Critics have hailed the film as one of Mammootty’s most empathetic turns, proving once again that he can embody fragility as convincingly as authority.\n\nIn contrast, his role in *One* showcases his political gravitas, as he steps into the shoes of Kerala’s Chief Minister. Here, Mammootty delivers a restrained, disciplined performance, avoiding the temptation of theatrical bombast. His presence in the film brings dignity and gravitas to a narrative otherwise brimming with melodrama, underlining how his control can elevate an entire production.\n\nOver the years, Mammootty has seamlessly moved between mass entertainers, experimental cinema, and character-driven dramas. From the fiery cop of *Kasaba* to the stoic patriarchs of family dramas, he continues to blur the lines between star and actor. His longevity is also remarkable—few actors in world cinema have managed to stay relevant across generations, consistently adapting to changing tastes while never losing their artistic integrity.\n\nInterestingly, while he enjoys iconic status, Mammootty himself rejects the superstar label. He has repeatedly said that he doesn’t see himself as larger than the role, a humility that explains his chameleon-like range. If Bollywood has Amitabh Bachchan for intensity and gravitas, Malayalam cinema has Mammootty for versatility and depth.\n\nHis legacy also extends to the next generation through his son, Dulquer Salmaan, who has carved out his own distinct career in Malayalam, Tamil, Telugu, and Hindi cinema. Unlike many star kids, Dulquer chose not to follow in his father’s exact footsteps. \"I couldn’t possibly do what he had already done. He has a larger-than-life image. I had to build my own path,\" Dulquer has admitted. While fans often dream of a father-son film collaboration, Dulquer has resisted the idea, wary of constant comparisons, though he has not ruled it out if a truly compelling story comes along.\n\nMammootty today stands as more than a screen legend. He is a cultural symbol of Malayalam cinema’s artistic spirit, a figure whose career reflects both the evolution of the industry and the resilience of an actor determined never to be typecast. Whether as a flawed human being wrestling with inner demons or as a towering leader commanding respect, Mammootty brings dignity, power, and soul to his craft.\n\nAs Indian cinema continues to expand its global reach, Mammootty remains one of its finest ambassadors—a reminder that stardom, when rooted in substance, never fades.",
    "author": "Daris Mathew",
    "date": "2025-09-13",
    "category": "Profiles",
    "image": "/mmty.png"
  },
  {
  "id": 3,
  "title": "‘Hridayapoorvam’ Day 16 Box Office: Crosses ₹34.2 CR, Surpasses ‘L2: Empuraan’ in One Key Metric",
  "excerpt": "Mohanlal’s comedy-drama shows steady growth despite competition from ‘Lokah’.",
  "content": "‘Hridayapoorvam’, starring Mohanlal, Malavika Mohanan, Sangeeth Prathap, and Sangita Madhavan Nair, has entered its third week with a stable performance at the box office. Released with moderate expectations, the film has managed to carve its own space despite facing stiff competition from the blockbuster ‘Lokah: Chapter 1 – Chandra’.\n\nBy day 16, the comedy-drama collected ₹80 lakh on Friday, slightly up from ₹75 lakh on day 15. This took its total Indian net collections to ₹34.2 crore, with a gross of ₹40.35 crore. The film’s trajectory shows modest but consistent growth.\n\nBreaking down the numbers:\n- Week 1 (8 days): ₹20 crore\n- Week 2: ₹13.4 crore\n- Day 16: ₹80 lakh\n- **Total (16 days): ₹34.2 crore net**\n\nInterestingly, ‘Hridayapoorvam’ has achieved a feat that surpasses Mohanlal’s mega-budget ‘L2: Empuraan’. With a day 1 opening of ₹3.25 crore, the film has now earned more than 10 times its opening day collections. In contrast, ‘L2: Empuraan’ opened at ₹21 crore but wrapped up with ₹106.64 crore net, which is just over five times its opening.\n\nMade on a budget of around ₹30 crore, the film has recovered costs with ₹34.2 crore net earnings, translating to a profit of ₹4.2 crore and a 14% return on investment. While not a blockbuster, the movie’s steady run and multiplier factor have marked it as a noteworthy success in Mollywood’s box office story this year.",
  "author": "Box Office Desk",
  "date": "2025-09-13",
  "category": "Box Office",
  "image": "/mohn.jpg"
}


]
